# HW2 - Answer Key - GR 5072
#### *For each question, there may be several approaches. This answer key only serves to provide one of the many solutions.*

**Setup**: Load libraries, import data, glance at data.

In [1]:
import pandas as pd
import numpy as np

path = r"C:\Users\nicho\OneDrive\Desktop\MDS\QMSS-GR5072-Spring2025-HWs\homework-2-main\Data"
nba = pd.read_csv(path + r"\Seasons_Stats_NBA.csv")
nba

,Year,Player,Pos,Age,Tm,G,GS,MP,PER,TS%,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1950.0,Curly Armstrong,G-F,31.0,FTW,63.0,NaN,NaN,NaN,0.368,...,0.705,NaN,NaN,NaN,176.0,NaN,NaN,NaN,217.0,458.0
1,1950.0,Cliff Barker,SG,29.0,INO,49.0,NaN,NaN,NaN,0.435,...,0.708,NaN,NaN,NaN,109.0,NaN,NaN,NaN,99.0,279.0
2,1950.0,Leo Barnhorst,SF,25.0,CHS,67.0,NaN,NaN,NaN,0.394,...,0.698,NaN,NaN,NaN,140.0,NaN,NaN,NaN,192.0,438.0
3,1950.0,Ed Bartels,F,24.0,TOT,15.0,NaN,NaN,NaN,0.312,...,0.559,NaN,NaN,NaN,20.0,NaN,NaN,NaN,29.0,63.0
4,1950.0,Ed Bartels,F,24.0,DNN,13.0,NaN,NaN,NaN,0.308,...,0.548,NaN,NaN,NaN,20.0,NaN,NaN,NaN,27.0,59.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
24686,2017.0,Cody Zeller,PF,24.0,CHO,62.0,58.0,1725.0,16.7,0.604,...,0.679,135.0,270.0,405.0,99.0,62.0,58.0,65.0,189.0,639.0
24687,2017.0,Tyler Zeller,C,27.0,BOS,51.0,5.0,525.0,13.0,0.508,...,0.564,43.0,81.0,124.0,42.0,7.0,21.0,20.0,61.0,178.0
24688,2017.0,Stephen Zimmerman,C,20.0,ORL,19.0,0.0,108.0,7.3,0.346,...,0.600,11.0,24.0,35.0,4.0,2.0,5.0,3.0,17.0,23.0
24689,2017.0,Paul Zipser,SF,22.0,CHI,44.0,18.0,843.0,6.9,0.503,...,0.775,15.0,110.0,125.0,36.0,15.0,16.0,40.0,78.0,240.0
24690,2017.0,Ivica Zubac,C,19.0,LAL,38.0,11.0,609.0,17.0,0.547,...,0.653,41.0,118.0,159.0,30.0,14.0,33.0,30.0,66.0,284.0

#### 1. Which NBA player scored the most points in a single season? What seasons/year was this? <a class="anchor" id="bullet1"></a>

Wilt Chamberlain in the 1962 season.

In [6]:
nba.sort_values(by = 'PTS', ascending = False)[['Year', 'Player', 'PTS']].head(2)  # Checking first 2 rows to make sure there isn't a tie

        Year             Player     PTS
1706  1962.0  Wilt Chamberlain*  4029.0
1827  1963.0  Wilt Chamberlain*  3586.0

#### 2. Which NBA player scored the most points in 1991? <a class="anchor" id="bullet2"></a>

In 1991, Michael Jordan scored the most points.

In [7]:
nba[nba["Year"] == 1991].sort_values(by = 'PTS', ascending = False)[["Year", "Player", "PTS"]].head(2) # Checking first 2 rows incase of a tie

         Year           Player     PTS
10212  1991.0  Michael Jordan*  2580.0
10251  1991.0     Karl Malone*  2382.0

#### 3. Which player had the best free throw percentage ("FT%") from the year 2000 to the most recent year in the data? <a class="anchor" id="bullet3"></a>

There are many players who have a FT% of 100%, below is a list of these players sorted by their name (Player). Don't need to sort, but it is nice to see who had 100% FT% while shooting the most shots.

In [10]:
nba_q3 = nba[nba['Year'] >= 2000]  # Takes 2 steps, since we need to copmute the max FT% after 2000 in the next step
nba_q3[nba_q3['FT%'] == nba_q3['FT%'].max()][["Year", "Player", "FTA", "FT%"]].sort_values(by = 'FTA', ascending = False)

         Year            Player   FTA  FT%
17798  2006.0        Dan Dickau  18.0  1.0
16931  2004.0         Glen Rice  17.0  1.0
21819  2013.0     Toney Douglas  16.0  1.0
15092  2001.0         Vinny Del  16.0  1.0
21998  2013.0  Shaun Livingston  15.0  1.0
...       ...               ...   ...  ...
16626  2004.0        Josh Davis   1.0  1.0
22630  2014.0      JaVale McGee   1.0  1.0
21921  2013.0      Juwan Howard   1.0  1.0
23637  2016.0    Branden Dawson   1.0  1.0
19816  2009.0     Mouhamed Sene   1.0  1.0

[313 rows x 4 columns]

#### 4. Among those with at least 50 attempts ('FTA'), which player had the best free throw percentage ("FT%") from the year 2000 to the most recent year in the data? <a class="anchor" id="bullet4"></a>

Among those with at least 50 free throw attempts (FTA), Terrell Brandon had the best FT% since 2000.

In [16]:
nba_q4 = nba[(nba['Year'] >= 2000) & (nba['FTA'] >= 50) & (nba['FT%'].notna())] # Need to do in two steps
nba_q4.sort_values(by = 'FT%' , ascending = False).head(2)[["Year", "Player", "FTA", "FT%"]]

         Year           Player    FTA    FT%
15565  2002.0  Terrell Brandon   84.0  0.988
19434  2009.0    Jose Calderon  154.0  0.981

#### 5. Rename the variable "Pos" to "Position".

In [18]:
nba_copy = nba.copy() # Make deep copy so orig dataset is not edited 
nba_copy.rename(columns = {"Pos":"Position"}, inplace = True) # inplace: If True then the data is modified directly, rather than returning shallow copy
nba_copy.head()

,Year,Player,Position,Age,Tm,G,GS,MP,PER,TS%,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1950.0,Curly Armstrong,G-F,31.0,FTW,63.0,NaN,NaN,NaN,0.368,...,0.705,NaN,NaN,NaN,176.0,NaN,NaN,NaN,217.0,458.0
1,1950.0,Cliff Barker,SG,29.0,INO,49.0,NaN,NaN,NaN,0.435,...,0.708,NaN,NaN,NaN,109.0,NaN,NaN,NaN,99.0,279.0
2,1950.0,Leo Barnhorst,SF,25.0,CHS,67.0,NaN,NaN,NaN,0.394,...,0.698,NaN,NaN,NaN,140.0,NaN,NaN,NaN,192.0,438.0
3,1950.0,Ed Bartels,F,24.0,TOT,15.0,NaN,NaN,NaN,0.312,...,0.559,NaN,NaN,NaN,20.0,NaN,NaN,NaN,29.0,63.0
4,1950.0,Ed Bartels,F,24.0,DNN,13.0,NaN,NaN,NaN,0.308,...,0.548,NaN,NaN,NaN,20.0,NaN,NaN,NaN,27.0,59.0

#### 6. Use this variable to create two variables that are called "first_position" and "second_position".

In [20]:
nba_copy[['first_position', 'second_position']] = nba_copy['Position'].str.split(pat = "-", expand=True)
nba_copy.head()[['Year', 'Player', 'first_position', 'second_position']]

     Year           Player first_position second_position
0  1950.0  Curly Armstrong              G               F
1  1950.0     Cliff Barker             SG            None
2  1950.0    Leo Barnhorst             SF            None
3  1950.0       Ed Bartels              F            None
4  1950.0       Ed Bartels              F            None

#### 7. Combine these two variables back into a single variable called "position_united".

In [30]:
nba_copy['position_united'] = np.where( nba_copy["second_position"].isnull(), nba_copy['first_position'], nba_copy['first_position'] + "-" + nba_copy['second_position'])
nba_copy.head()[['Year', 'Player', 'position_united', 'first_position', 'second_position']]
# nba_copy['position_united'].value_counts()  # Checking data via frequency tables

     Year           Player position_united first_position second_position
0  1950.0  Curly Armstrong             G-F              G               F
1  1950.0     Cliff Barker              SG             SG            None
2  1950.0    Leo Barnhorst              SF             SF            None
3  1950.0       Ed Bartels               F              F            None
4  1950.0       Ed Bartels               F              F            None

#### 8. Create two new datasets. <a class="anchor" id="bullet8"></a>

* a new dataset from the original dataset that includes all data except the age variable (be sure to give this dataset a new name).
* a new dataset from the original dataset that includes the year, the player name, and age.
* add a new column to both datasets called mergeid that includes a sequence of numbers beginning with a 1 in the first row of the data and ending with the total number of rows in the last row of the data

In [32]:
nba_1 = nba.drop(columns=['Age']).copy()      # dataset with all except age
nba_2 = nba[['Year', 'Player', 'Age']].copy() # dataset with only year, name, and age

# Since both datasets are in the same order, we can create matching keys by using a numbered list of integers
nba_1['mergeid'] = range(1, len(nba_1) + 1) # add mergeid based on the length of the dataset
nba_2['mergeid'] = range(1, len(nba_2) + 1) # add mergeid based on the length of the dataset

In [23]:
# Check data
print(nba_1.shape)
print(nba_1.columns)
print(nba_2.shape)
print(nba_2.columns)

(24691, 52)
Index(['Year', 'Player', 'Pos', 'Tm', 'G', 'GS', 'MP', 'PER', 'TS%', '3PAr',
       'FTr', 'ORB%', 'DRB%', 'TRB%', 'AST%', 'STL%', 'BLK%', 'TOV%', 'USG%',
       'blanl', 'OWS', 'DWS', 'WS', 'WS/48', 'blank2', 'OBPM', 'DBPM', 'BPM',
       'VORP', 'FG', 'FGA', 'FG%', '3P', '3PA', '3P%', '2P', '2PA', '2P%',
       'eFG%', 'FT', 'FTA', 'FT%', 'ORB', 'DRB', 'TRB', 'AST', 'STL', 'BLK',
       'TOV', 'PF', 'PTS', 'mergeid'],
      dtype='object')
(24691, 4)
Index(['Year', 'Player', 'Age', 'mergeid'], dtype='object')

#### 9. Join the two datasets from question (8) together to recreate the original dataset plus the new merge id. <a class="anchor" id="bullet9"></a>

In [28]:
# Join the two datasets, you could also use a left or right join since the number of rows and unique keys match perfectly 
nba_merge = nba_1.merge(nba_2, how = 'inner', left_on = ['mergeid'], right_on = ['mergeid'])
nba_merge

,Year_x,Player_x,Pos,Tm,G,GS,MP,PER,TS%,3PAr,...,AST,STL,BLK,TOV,PF,PTS,mergeid,Year_y,Player_y,Age
0,1950.0,Curly Armstrong,G-F,FTW,63.0,NaN,NaN,NaN,0.368,NaN,...,176.0,NaN,NaN,NaN,217.0,458.0,1,1950.0,Curly Armstrong,31.0
1,1950.0,Cliff Barker,SG,INO,49.0,NaN,NaN,NaN,0.435,NaN,...,109.0,NaN,NaN,NaN,99.0,279.0,2,1950.0,Cliff Barker,29.0
2,1950.0,Leo Barnhorst,SF,CHS,67.0,NaN,NaN,NaN,0.394,NaN,...,140.0,NaN,NaN,NaN,192.0,438.0,3,1950.0,Leo Barnhorst,25.0
3,1950.0,Ed Bartels,F,TOT,15.0,NaN,NaN,NaN,0.312,NaN,...,20.0,NaN,NaN,NaN,29.0,63.0,4,1950.0,Ed Bartels,24.0
4,1950.0,Ed Bartels,F,DNN,13.0,NaN,NaN,NaN,0.308,NaN,...,20.0,NaN,NaN,NaN,27.0,59.0,5,1950.0,Ed Bartels,24.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
24686,2017.0,Cody Zeller,PF,CHO,62.0,58.0,1725.0,16.7,0.604,0.002,...,99.0,62.0,58.0,65.0,189.0,639.0,24687,2017.0,Cody Zeller,24.0
24687,2017.0,Tyler Zeller,C,BOS,51.0,5.0,525.0,13.0,0.508,0.006,...,42.0,7.0,21.0,20.0,61.0,178.0,24688,2017.0,Tyler Zeller,27.0
24688,2017.0,Stephen Zimmerman,C,ORL,19.0,0.0,108.0,7.3,0.346,0.000,...,4.0,2.0,5.0,3.0,17.0,23.0,24689,2017.0,Stephen Zimmerman,20.0
24689,2017.0,Paul Zipser,SF,CHI,44.0,18.0,843.0,6.9,0.503,0.448,...,36.0,15.0,16.0,40.0,78.0,240.0,24690,2017.0,Paul Zipser,22.0
24690,2017.0,Ivica Zubac,C,LAL,38.0,11.0,609.0,17.0,0.547,0.013,...,30.0,14.0,33.0,30.0,66.0,284.0,24691,2017.0,Ivica Zubac,19.0

#### 10. Subset the original dataset to the years 1995-1997. Group the data by team name and year then summarize the average number of points per team. Arrange from most to least points. <a class="anchor" id="bullet10"></a>

In [35]:
nba_10 = nba[nba["Year"].isin([1995, 1996, 1997])]  
nba_10_1 = nba_10.groupby(['Tm', 'Year'])[['PTS']].mean().sort_values('PTS', ascending = False)
nba_10_1 # .to_csv('test.csv', index=True )

                   PTS
Tm  Year
SEA 1996.0  659.384615
    1995.0  646.785714
MIN 1997.0  606.307692
ORL 1995.0  606.066667
PHO 1995.0  604.866667
...                ...
DEN 1997.0  348.695652
NJN 1997.0  346.695652
PHI 1996.0  322.750000
TOT 1997.0  322.380952
DAL 1997.0  275.222222

[88 rows x 1 columns]

In [67]:
nba_10_1.reset_index().Tm.value_counts()

Tm
SEA    3
MIN    3
ATL    3
TOT    3
DEN    3
BOS    3
HOU    3
GSW    3
PHI    3
CHH    3
NJN    3
SAC    3
POR    3
WSB    3
CLE    3
MIA    3
DET    3
SAS    3
CHI    3
IND    3
MIL    3
LAC    3
UTA    3
NYK    3
LAL    3
DAL    3
PHO    3
ORL    3
VAN    2
TOR    2
Name: count, dtype: int64

In [69]:
type(nba_10_1)  # It's always important to know the type of Python objects we are working with

pandas.core.frame.DataFrame

In [71]:
nba_10_1.shape

(88, 1)

#### 11. Similar to Q10, start by subsetting the original dataset to the years 1995-1997. Then create a wide dataset that keeps each year in its own row, but spreads team names to multiple columns with each column delineating points per team in each of the 1995-1997 seasons (Hint: Your final answer should have a shape of 3 x 30).  <a class="anchor" id="bullet11"></a>

In [74]:
nba_11 = nba_10.pivot_table(index = 'Year', columns = 'Tm', values = 'PTS')
nba_11.head()

Tm,ATL,BOS,CHH,CHI,CLE,DAL,DEN,DET,GSW,HOU,...,PHO,POR,SAC,SAS,SEA,TOR,TOT,UTA,VAN,WSB
Year,,,,,,,,,,,,,,,,,,,,,
1995.0,440.055556,495.764706,515.562500,520.312500,494.466667,604.428571,488.764706,503.312500,481.500000,499.470588,...,604.866667,528.187500,537.066667,546.375000,646.785714,NaN,488.681818,581.733333,NaN,515.125000
1996.0,447.722222,471.944444,401.476190,575.000000,498.200000,560.600000,471.352941,558.714286,490.235294,466.888889,...,503.058824,543.000000,510.187500,565.133333,659.384615,420.736842,419.767857,600.285714,409.0000,400.380952
1997.0,457.294118,458.222222,450.444444,563.866667,551.769231,275.222222,348.695652,482.687500,510.687500,458.222222,...,366.565217,427.052632,494.250000,370.900000,517.125000,372.809524,322.380952,563.600000,457.0625,543.133333

#### 12. Now return the data from #11 back into a long (tidy) format by moving Tm, Points and Year into their own columns. <a class="anchor" id="bullet12"></a>

In [39]:
nba_12 = nba_11.reset_index().melt(id_vars = 'Year', value_name = 'Points') 
nba_12

      Year   Tm      Points
0   1995.0  ATL  440.055556
1   1996.0  ATL  447.722222
2   1997.0  ATL  457.294118
3   1995.0  BOS  495.764706
4   1996.0  BOS  471.944444
..     ...  ...         ...
85  1996.0  VAN  409.000000
86  1997.0  VAN  457.062500
87  1995.0  WSB  515.125000
88  1996.0  WSB  400.380952
89  1997.0  WSB  543.133333

[90 rows x 3 columns]

In [41]:
nba_11.reset_index() # To help learn how the code is working, submit it in chunks like this

Tm,Year,ATL,BOS,CHH,CHI,CLE,DAL,DEN,DET,GSW,...,PHO,POR,SAC,SAS,SEA,TOR,TOT,UTA,VAN,WSB
0,1995.0,440.055556,495.764706,515.562500,520.312500,494.466667,604.428571,488.764706,503.312500,481.500000,...,604.866667,528.187500,537.066667,546.375000,646.785714,NaN,488.681818,581.733333,NaN,515.125000
1,1996.0,447.722222,471.944444,401.476190,575.000000,498.200000,560.600000,471.352941,558.714286,490.235294,...,503.058824,543.000000,510.187500,565.133333,659.384615,420.736842,419.767857,600.285714,409.0000,400.380952
2,1997.0,457.294118,458.222222,450.444444,563.866667,551.769231,275.222222,348.695652,482.687500,510.687500,...,366.565217,427.052632,494.250000,370.900000,517.125000,372.809524,322.380952,563.600000,457.0625,543.133333

##